Repository: balconyRewrap/Jaomix-Downloader
Catalog: JaomixDownloader/Resources/GlobalResources.*.resx
Languages: ru

# authorName
source: Enter Author's Name
ru: Введите имя автора

# bookFileNameEPUB
source: Enter the name of the .epub file, for example text.epub !PLEASE, USE ONLY ENGLISH SYMBOLS IN NAME!
ru: Введите название файла .epub, например text.epub

# bookFileNameNoExtensions
source: Enter the name of the file (without .txt) where the book will be written !PLEASE, USE ONLY ENGLISH SYMBOLS IN NAME!
ru: Введите название файла (без .txt), куда запишется книга

# bookFileNameTXT
source: Enter the name of the .txt file, for example text.txt !PLEASE, USE ONLY ENGLISH SYMBOLS IN NAME!
ru: Введите название файла .txt, например text.txt

# bookName
source: Enter Book Title
ru: Введите название книги

# bookTxtMakeSuccess
source: Book .txt file created successfully
ru: Файл книги .txt создан успешно

# bookUrl
source: Enter the url of the book's webpage
ru: Введите url адрес страницы с книгой, например https://jaomix.ru/category/prepodobnyj-gu/

# chapterLinksNumber
source: Number of links to chapters -
ru: Количество ссылок на главы -

# choicerInitHeader
source: Choose the function you need: Enter 1, if you need a Fast Chapter Downloader Enter 2, if you need a Links Parser Enter 3, if you need a Slow Chapter Fownloader Enter 4, if you need a Txt to Epub Converter Enter 5, if you need a Book Maker Enter 6, if you need to change The Active Folder of the Program Enter 7, if you need to change Language Enter 8, if you need to change Operating System Choice Enter 0, if you need to close Program
ru: Выберите нужную вам функцию: Введите 1, если необходим скачиватель глав быстрый Введите 2, если необходим парсерс ссылок Введите 3, если необходим скачиватель глав медленный Введите 4, если необходим конвертер из txt в epub Введите 5, если необходимо сделать Epub из .txt + .yaml Введите 6, если необходимо поменять активную папку программы Нажмите 7, если необходимо сменить язык / Enter 6, if you need to change language Введите 0, если необходимо выйти

# delTempFiles
source: Should the program save the .txt files of each chapter? Press ENTER, if shouldn't save Enter 1, if should save
ru: Необходимо ли вам оставлять .txt файлы каждой главы? Нажмите ENTER, если не необходимо Введите 1, если необходимо

# finalFileExtension
source: What output file is required? Press ENTER if .epub is needed Enter 1, if .txt is needed
ru: Какой итоговый файл необходим? Нажмите ENTER, если необходим .epub Введите 1, если необходим .txt

# linksFileName
source: Enter the name of the file (with .txt) with links. It must be in the active folder of the program.
ru: Введите название файла (с .txt) со ссылками. Он должен находиться в активной папке программы.

# linksFileNameNew
source: Enter a name (with .txt) for the file where the links will be saved. The file will be saved to the active folder of the program. !PLEASE, USE ONLY ENGLISH SYMBOLS IN NAME!
ru: Введите имя (с .txt) для файла, куда сохраняться ссылки. Файл будет сохранен в активную папку программы.

# paragraphGetError
source: Attempt to get the paragraph at the given url got nothing. Perhaps there are problems with the site or there is no connection. I try again. If this message appears too often, close the program
ru: Попытка получить параграф по данному адресу не получила ничего. Возможно, сайт упал или нет соединения. Повторяю попытку. Если данное сообщение будет выводиться слишком часто, закройти программу

# parseLinksAgain
source: Need to search for links again? Press ENTER, if not needed Enter 1, if needed
ru: Необходимо ли повторить поиск ссылок? Нажмите ENTER, если нет необходимости Введите 1, если необходимо
